УправлениПарком/src/DataProcessors/ПланиеровекниОтпусков/ПланиеровекниОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПланиеровекниОтпусков</name>
</mdclass:DataProcessor>

УправлениПарком/src/InformationRegisters/ПлановыеОтсутствия/ПлановыеОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеОтсутствия</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениПарком/src/DataProcessors/ПланиеровекниОтпусков/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаСервере()

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыеОтсутствия.ДатаНачала КАК ДатаНачала,
		|	ПлановыеОтсутствия.ДатаОкончания КАК ДатаОкончания,
		|	ПлановыеОтсутствия.Сотрудник КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(ПлановыеОтсутствия.Сотрудник) КАК СотрудникПредставление,
		|	ПлановыеОтсутствия.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПлановыеОтсутствия КАК ПлановыеОтсутствия
		|ГДЕ
		|	ПлановыеОтсутствия.ДатаНачала < &КонецПериода
		|	И ПлановыеОтсутствия.ДатаОкончания > &НачалоПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
 	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДиаграммаГанта.Очистить();
	
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Значение = "Отсутствия";
	Серия.Текст = "Отсутствия";
	
	ТочкиСотрудников = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		
		Точка = ТочкиСотрудников.Получить(Выборка.Сотрудник);
		
		Если Точка = Неопределено Тогда
			Точка = ДиаграммаГанта.Точки.Добавить();
			Точка.Значение = Выборка.Сотрудник;
			Точка.Текст = Выборка.СотрудникПредставление;
			ТочкиСотрудников.Вставить(Выборка.Сотрудник, Точка);
		КонецЕсли;
			
		
  		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.ДатаНачала;
		Интервал.Конец = Выборка.ДатаОкончания;
		Интервал.Расшифровка = Выборка.Регистратор;
		
	КонецЦикла;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	 
	
КонецПроцедуры
#КонецОбласти
